Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
			//Sort the servo times in ascending order
			Sort();
			//Set period for 1st servo
			newPeriod = legAngles[servoCount];
			while (newPeriod == 0)
			{
				++servoCount;
				newPeriod = legAngles[servoCount];
			}
				
			TIM7->ARR = newPeriod;
			//Start the timer
			HAL_TIM_Base_Start(&htim7);
			
			//BT LED
			++BTCount;
			if (BTCount > 120) //20ms * 120 = 2.4s
			{
				//Turn LED off
				HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
				HAL_GPIO_WritePin(servoPowerPort,servoPowerPin,GPIO_PIN_RESET);
				BTCount = 0;
			}
		}

	}

//void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
//	{
//		if(htim == &htim7)
//		{
//			HAL_GPIO_WritePin(GPIOB,GPIO_PIN_12,GPIO_PIN_RESET);
//			HAL_TIM_Base_Stop(&htim7);
//		}
////			{
////			//Variable frequency interrupt
////			switch (servoCount)
////			{
////				case 0:
////					Debug("0",1);
////					break;
////				case 1:
////					Debug("1",1);
////					break;
////				case 2:
////					Debug("2",1);
////					break;
////				case 3:
////					Debug("3",1);
////					break;
////				case 4:
////					Debug("4",1);
////					break;
////				case 5:
////					Debug("5",1);
////					break;
////				case 6:
////					Debug("6",1);
////					break;
////				case 7:
////					Debug("7",1);
////					break;
////				case 8:
////					Debug("8",1);
////					break;
////				case 9:
////					Debug("9",1);
////					break;
////				case 10:
////					Debug("10",1);
////					break;
////				case 11:
////					Debug("11",1);
////					break;
////				case 12:
////					Debug("12",1);
////					break;
////				case 13:
////					Debug("13",1);
////					break;
////				case 14:
////					Debug("14",1);
////					break;
////				case 15:
////					Debug("15",1);
////					break;
////				
////			}
////			
////			++servoCount;
////			//Set period for next interrupt
////			if (servoCount == 1)
////			{
////				newPeriod = legAngles[servoCount-1];
////			}else if (servoCount < 15)
////			{
////				newPeriod = (legAngles[servoCount]- legAngles[servoCount-1]);
////				//newPeriod = legAngles [servoCount-1];
////				while (newPeriod == 0)
////				{
////					HAL_GPIO_WritePin(servoPortArray[servoCount] ,servoPinArray[servoCount],GPIO_PIN_RESET);
////					++servoCount;
////					newPeriod = (legAngles[servoCount]- legAngles[servoCount-1]);
////				}
////				TIM7->CNT = 0;
////				TIM7->ARR = 100;
////				HAL_GPIO_TogglePin(greenLEDPort,greenLEDPin);
////				HAL_GPIO_WritePin(servoPortArray[servoCount] ,servoPinArray[servoCount],GPIO_PIN_RESET);
////			}else{
////				//Stop the timer for the rest of the cycle
////				HAL_TIM_Base_Stop(&htim7);
////				//servoCount = 0;
////			}
////			//Set the correct servo low
////			
////		}
//		//HAL_GPIO_TogglePin(greenLEDPort,greenLEDPin);

//		
//		if (htim == &htim6)
//		{
//			//50Hz Interrupt
//			HAL_GPIO_TogglePin(redLEDPort,redLEDPin);
//			//Set all servo pins
//			HAL_GPIO_WritePin(servo1Port,servo1Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo2Port,servo2Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo3Port,servo3Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo4Port,servo4Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo5Port,servo5Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo6Port,servo6Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo7Port,servo7Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo8Port,servo8Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo9Port,servo9Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo10Port,servo10Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo11Port,servo11Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo12Port,servo12Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo13Port,servo13Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo14Port,servo14Pin,GPIO_PIN_SET);
//			HAL_GPIO_WritePin(servo15Port,servo15Pin,GPIO_PIN_SET);
//			servoCount = 0;
//			
//			
//			//Sort the servo times in ascending order
//			//Sort();
//			//Set period for 1st servo
//			//TIM7->ARR = legAngles[0];
//			
//			//BT LED
//			++BTCount;
//			if (BTCount > 120) //20ms * 120 = 2.4s
//			{
//				//Turn LED off
//				HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
//				BTCount = 0;
//				//Start Timer 7
//				//TIM7->CNT = 0;
//				HAL_TIM_Base_Start_IT(&htim7);
//			}
//		}
//	}
	
	void SetServo(int servo, int degrees)
	{
		//Set the servo with the correct index in the array 
		for (int i = 0; i<15; i++)
		{
			if (servo == legAngles_id[i])
			{
				legAngles[i] =servoOffset[servo-1] + (degrees*(servoMultiplier[servo-1])/180);
			}
		}
		//period of 160 is 1.5ms
		//=>107/ms
//		legAngles[servo-1] =servoOffset[servo-1] + (degrees*(servoMultiplier[servo-1])/180);   
//		TIM7->ARR = legAngles[servo-1];
	}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }

	
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
